'''Серіалізація об'єктів в Python — це процес перетворення структури даних або об'єкта 
в потік байтів для зберігання або передачі. Цей потік байтів може бути збережений у файлі, 
переданий через мережу або навіть використаний для зберігання в базі даних. 
Ціль серіалізації — зберегти стан об'єкта так, щоб його можна було відновити в майбутньому.
Процес відновлення стану об'єкта з серіалізованої форми називається десеріалізацією.
'''

expenses = {"hotel": 150, "breakfast": 30, "taxi": 15, "lunch": 20}

# збереження даних у текстовий файл
file_name = "expenses.txt"
with open(file_name, "w") as fh:
    for key, value in expenses.items():
        fh.write(f"{key}|{value}\n")
'''hotel|150
breakfast|30
taxi|15
lunch|20
'''

# завантажити цей перелік назад у Python
file_name = "expenses.txt"
expenses = {}

with open(file_name, "r") as fh:
    raw_expenses = fh.readlines()
    for line in raw_expenses:
        key, value = line.split("|")
        expenses[key] = int(value)

print(expenses) # {'hotel': 150, 'breakfast': 30, 'taxi': 15, 'lunch': 20}

#--------------------------------------

'''Python надає декілька модулів для серіалізації, найпопулярнішими з яких є pickle і json.'''


'''Модуль pickle дозволяє серіалізувати об'єкти Python у потік байтів та десеріалізувати 
потік байтів назад у об'єкти. Це виправдано та корисно для зберігання об'єктів у файлах
або передачі даних через мережу.
Основна мета pickle — зберегти стан об'єкта так, щоб його можна було точно відновити пізніше
і часто в іншому місці.

У пакета pickle є дві пари парних методів:

Метод dumps запаковує в byte-рядок об'єкт, а метод loads потім розпаковує назад 
з byte-рядка в об'єкт. Ці методи потрібні, коли ми хочемо контролювати, що робити 
з byte представленням, наприклад, відправити його мережею або прийняти з мережі.
'''
import pickle

my_data = {"key": "value", "num": 42}# Об'єкт для серіалізації

serialized_data = pickle.dumps(my_data)# Серіалізація об'єкта в байтовий рядок
# Виведе байтовий рядок
print(serialized_data)  # b'\\x80\\x04\\x95\\x1b\\x00\\x00\\x00\\x00\\x00\\x00\\x00}\\x94(\\x8c\\x03key\\x94\\x8c\\x05value\\x94\\x8c\\x03num\\x94K*u.'

deserialized_data = pickle.loads(serialized_data)# Десеріалізація об'єкта з байтового рядка
# Виведе вихідний об'єкт Python
print(deserialized_data) #{'key': 'value', 'num': 42}


'''методи dump та load, що упаковують дані у файл та розпаковують із файлу'''

with open("data.pickle", "wb") as file: # Серіалізація об'єкта в файл
    pickle.dump(my_data, file)

with open('data.pickle', 'rb') as file: # Десеріалізація об'єкта з файлу
    deserialized_data = pickle.load(file)
# Виведе вихідний об'єкт Python
print(deserialized_data) #{'key': 'value', 'num': 42}


'''Самі класи та функції pickle зберігати не вміє і, якщо вам потрібно розпакувати 
упакований об'єкт класу, то сам клас повинен бути оголошений раніше у коді.'''

class Human:
    def __init__(self, name):
        self.name = name

bob = Human("Bob")
with open("instance.pickle", "wb") as file:
    pickle.dump(bob, file)

'''Важливо, щоб клас Human був визначений у скрипті, який виконує десеріалізацію, 
із тією ж структурою та в тому ж просторі імен, що й у скрипті, який виконав серіалізацію.

Якщо при десеріалізації не вказати клас Human ми отримаємо помилку.
'''

class Human:
    def __init__(self, name):
        self.name = name

with open("instance.pickle", "rb") as file:
    loaded_instance = pickle.load(file)

print(loaded_instance.name) #Bob


'''Одна із розповсюджених практик це збереження налаштувань програми. Якщо ваша програма 
дозволяє користувачам налаштовувати різні параметри, ви можете серіалізувати ці налаштування
 в файл і десеріалізувати їх при наступному запуску програми для користувача.'''

# Збереження налаштувань
settings = {'theme': 'dark', 'language': 'ukrainian'}
with open('settings.pickle', 'wb') as f:
    pickle.dump(settings, f)

# Завантаження налаштувань
with open('settings.pickle', 'rb') as f:
    loaded_settings = pickle.load(f)

'''Також серіалізація може бути використана для кешування складних обчислень. 
Уявимо, що обчислення займають багато часу, і інколи нам необхідно переривати виконання 
обчислень. Можна зберегти результати в серіалізованому вигляді і швидко відновити їх 
при наступній ітерації обчислень.

В веб розробці pickle найчастіше застосовується при передачі об'єктів між різними частинами 
програми, які працюють як окремі процеси, або між програмами, які виконуються 
на різних комп'ютерах у мережі.

Також інколи складні структури даних не вписуються в стандартні типи даних баз даних. 
В такому випадку, серіалізація дозволяє перетворити ці структури в байтові рядки, 
які можна зберігати як текст або BLOB (Binary Large Object) у базі даних.'''


'''JSON, або JavaScript Object Notation, є текстовим форматом для представлення 
структурованих даних на основі синтаксису об'єктів мови програмування JavaScript.
для обміну даними між клієнтами та серверами, веб-застосунками. 
для зберігання конфігурацій, серіалізації даних в файлових системах та як формат обміну даними
між різними мовами програмування

Він представляє дані як набір ключ-значення, де ключі є рядками, а значення можуть бути 
рядками, числами, масивами, логічними значеннями або навіть іншими об'єктами.
Це дозволяє легко представляти складні структури даних, такі як списки, словники та 
ієрархічні дерева.

Синтаксис JSON базується на двох структурних елементах: об'єкти та масиви.
'''
import json

some_data = {
    "key": "value",
    2: [1, 2, 3],
    "my_tuple": (5, 6),
    "my_dict": {"key": "value"},
}

json_string = json.dumps(some_data)
print(json_string) # {"key": "value", "2": [1, 2, 3], "my_tuple": [5, 6], "my_dict": {"key": "value"}}

#unpacked_some_data не дорівнює some_data, і ми не отримали той самий об'єкт
unpacked_some_data = json.loads(json_string)
print(unpacked_some_data) # {'key': 'value', '2': [1, 2, 3], 'my_tuple': [5, 6], 'my_dict': {'key': 'value'}}


'''Кодування об’єктів Python у формат JSON відбувається за наступними правилами:

Модуль json перетворює dict в об’єкти JSON,
Список і кортеж перетворюються в масив JSON.
Рядок Python перетворюється на рядок JSON.
Цілі числа та дійсні числа перетворюються на числа JSON.
Логічне значення True перетворюється на константу JSON true.
Логічне значення False перетворюється на константу JSON false.
None перетворюється на константу JSON null.
'''

'''Серіалізація об'єкта Python у рядок формату JSON виконується за допомогою методу json.dump(),
якщо потрібно записати JSON безпосередньо у файл'''

# Python об'єкт (словник)
data = {"name": "Gupalo Vasyl", "age": 30, "isStudent": True}

# Серіалізація у файл
with open("data.json", "w", encoding="utf-8") as f:
    json.dump(data, f)
# Після виконання коду, в тій же директорії де знаходиться скрипт, ми повинні отримати 
# файл data.json з наступним вмістом: {"name": "Gupalo Vasyl", "age": 30, "isStudent": true}

'''Десеріалізація перетворює рядок у форматі JSON назад у відповідні об'єкти Python. Це виконується
 за допомогою методу json.load(), якщо JSON читається безпосередньо з файлу.'''

# Десеріалізація з файлу
with open("data.json", "r", encoding="utf-8") as f:
    data_from_file = json.load(f)
    print(data_from_file) # {'name': 'Gupalo Vasyl', 'age': 30, 'isStudent': True}

'''Проблема може виникнути тільки при записі у файл JSON кирилиці або будь-яких інших 
не ASCII символів. Тому важливо забезпечити правильне кодування символів, щоб уникнути проблем 
з читанням файлу та його сумісністю. Python за замовчуванням використовує кодування UTF-8, 
яке підтримує кирилицю, але при записі в JSON нам необхідно вказати додаткові параметри 
для забезпечення коректного відображення символів.'''

# Python об'єкт (словник)
data = {"name": "Гупало Василь", "age": 30, "isStudent": True}

# Серіалізація у файл
with open("data.json", "w", encoding="utf-8") as f:
    json.dump(data, f) #{"name": "\\u0413\\u0443\\u043f\\u0430\\u043b\\u043e \\u0412\\u0430\\u0441\\u0438\\u043b\\u044c", "age": 30, "isStudent": true}

#Як бачимо замість рядка "Гупало Василь" в нас набір Unicode escape-послідовностей. 
#Кожна escape-послідовність починається з \u , за яким слідує чотири шістнадцяткових цифр, 
#які представляють символ у Unicode.'''

# Серіалізація у файл
with open("data.json", "w", encoding="utf-8") as f:
    json.dump(data, f, ensure_ascii=False, indent=4)

'''ensure_ascii=False гарантує, що символи кирилиці будуть записані як є, без перетворення 
в їхні Unicode escape-послідовності.
indent=4 забезпечує форматування виведення, роблячи JSON файл легшим для читання людиною 
за допомогою відступів.
{
    "name": "Гупало Василь",
    "age": 30,
    "isStudent": true
}
'''



'''CSV (Comma-Separated Values) — формат файлу, що використовується для зберігання табличних даних. 
Його назва походить від основної ідеї - використання коми для відділення значень в середині рядка.
Однак на практиці як роздільник можуть використовуватися й інші символи, наприклад крапка з комою ;
або знак табуляції. 
Файл CSV складається з рядків, і кожен рядок представляє один запис. Записи поділяються на поля, 
які розділені зазвичай комами. Перший рядок у файлі часто використовується для заголовків, 
що описують зміст кожного поля у записах.
'''

'''Різні операційні системи використовують різні символи для позначення кінця рядка в 
текстових файлах: Windows використовує повернення каретки та переведення рядка \r\n, 
Linux та MacOS використовує лише переведення рядка \n
Коли ми відкриваємо файл для читання чи запису, параметр newline='' інструктує Python 
не проводити жодної спеціальної обробки символів кінця рядка. 
'''
'''Для запису даних у CSV файл можна використати функцію csv.writer. '''
import csv

# Дані для запису
rows = [
    ["name", "age", "specialty"],
    ["Василь Гупало", 30, "Математика"],
    ["Марія Петренко", 22, "Фізика"],
    ["Олександр Коваленко", 20, "Інформатика"],
]


with open("data.csv", "w", newline="", encoding="utf-8") as csvfile: # Відкриваємо файл для запису
    writer = csv.writer(csvfile, delimiter=",")       # Створюємо об'єкт writer
    writer.writerows(rows)                            # Записуємо рядки даних


'''Для читання даних з CSV файлу можна використовувати функцію csv.reader, що повертає об'єкт, 
який ітерує по рядках файлу.'''

with open("data.csv", newline="", encoding="utf-8") as csvfile:
    reader = csv.reader(csvfile, delimiter=",")    # Створюємо об'єкт reader
    for row in reader:                             # Проходимося по кожному рядку у файлі
        print(", ".join(row))

'''name, age, specialty
Василь Гупало, 30, Математика
Марія Петренко, 22, Фізика
Олександр Коваленко, 20, Інформатика
'''  

'''За допомогою writer.writerows(rows) можна записати кілька рядків одразу. 
Якщо потрібно записати один рядок, можна використати writer.writerow(row).

використання DictReader і DictWriter полегшує доступ до полів за їхніми назвами 
та автоматизує процес запису заголовків стовпців.
'''

# Запис у CSV файл зі словників
with open("students.csv", "w", newline="", encoding="utf-8") as csvfile:
    fieldnames = ["name", "age", "specialty"]
    writer = csv.DictWriter(csvfile, fieldnames=fieldnames)

    writer.writeheader()
    writer.writerow({"name": "Олег Олегов", "age": 23, "specialty": "Історія"})
    writer.writerow({"name": "Анна Сергіївна", "age": 22, "specialty": "Біологія"})

# Читання з CSV файлу в словники
with open("students.csv", newline="", encoding="utf-8") as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(row["name"], row["age"], row["specialty"])

'''name, age, specialty
Василь Гупало, 30, Математика
Марія Петренко, 22, Фізика'''

#----------------------------------------------

FILENAME = "users.csv"

users = [
    {"name": "Микола", "age": 22, "gender": "male"},
    {"name": "Марія", "age": 22, "gender": "female"},
    {"name": "Назар", "age": 22, "gender": "male"},
]

with open(FILENAME, "w", encoding="utf-8", newline="") as f:
    columns = users[0].keys() # імена колонок визначили через ключі першого словника у списку users
    writer = csv.DictWriter(f, delimiter=",", fieldnames=columns)
    writer.writeheader()
    for row in users:
        writer.writerow(row)

'''name,age,gender
Микола,22,male
Марія,22,female
Назар,22,male'''

with open(FILENAME, "r", encoding="utf-8", newline="") as f:
    reader = csv.DictReader(f)

    for row in reader:
        print(row)

'''{'name': 'Микола', 'age': '22', 'gender': 'male'}
{'name': 'Марія', 'age': '22', 'gender': 'female'}
{'name': 'Назар', 'age': '22', 'gender': 'male'}'''



