this_is_string = "Hi there!"

the_same_string = 'Hi there!'

print(this_is_string == the_same_string) # True

text = """This is first line
And second line
Last third line"""

song = '''Jingle bells, jingle bells
Jingle all the way
Oh, what fun it is to ride
In a one horse open sleigh'''

# Щоб структурувати код і не додавати зайвих перенесень, 
# ви можете розбити одну рядкову змінну на декілька частин
# символ \ в кінці рядка коду вказує інтерпретатору ігнорувати закінчення рядка 
# і продовжити відразу з наступного.

one_line_text = "Textual data in Python is handled with str objects," \
                " or strings. Strings are immutable sequences of Unicode" \
                " code points. String literals are written in a variety " \
                " of ways: single quotes, double quotes, triple quoted." 

#У Python, коли ви поміщаєте два рядкових літерали поруч, вони автоматично конкатенуються 

("spam " "eggs") == "spam eggs"  # True

one_line_text = ("Textual data in Python is handled with str objects,"
                " or strings. Strings are immutable sequences of Unicode"
                " code points. String literals are written in a variety "
                " of ways: single quotes, double quotes, triple quoted.")

print(one_line_text)

query = ("SELECT * "
         "FROM some_table "
         "WHERE condition1 = True "
         "AND condition2 = False") #це дуже допомагає при створенні SQL запитів до бази даних

print("Hello\nWorld") # символ \n відповідає за перенос рядка (line break)
print("Hello\tWorld") #  горизонтальна табуляція \t (tab)
print("Hello my little\rsister") # sistermy little  для повернення каретки \r (carriage return),
#коли ми зустрічаємо символ \r, то повертаємося на початок рядка і продовжуємо виведення
print("Hello\bWorld") # Керувальний символ \b — забій (backspace)  HellWorld
print("Hello\\World") # треба виконати виведення зворотної скісної риски  Hello\World

print('It\'s a beautiful day') #Щоб екранувати одинарні та подвійні лапки та дозволити використовувати лапки всередині рядкових літералів.
print("He said, \"Hello\"") # It's a beautiful day  He said, "Hello"


s = "Hi there!"
start = 0
end = 7
print(s.find("er", start, end)) # 5  повертає індекс початку першого збігу в рядку s, починаючи з позиції start до позиції end
print(s.find("q")) # -1 (послідовність не знайдена)

s = 'Some words'
print(s.find("o")) # 1 здійснити пошук підрядка у рядку зліва
print(s.rfind('o')) # 6 здійснити пошук підрядка у рядку справа

s = 'Some words'
print(s.index("o")) # 1 якщо index не знайде підрядок, то викличе виняток ValueError
print(s.rindex('o')) # 6


# str.split(separator=None, maxsplit=-1)  для розбиття рядка
#на список підрядків на основі вказаного роздільника. 
#Якщо роздільник не вказаний, за замовчуванням використовується пробіл.
# maxsplit - максимальна кількість розділень. Значення -1 означає "без обмежень".

text = "hello world"
result = text.split()
print(result)  # Виведе: ['hello', 'world']

text = "apple,banana,cherry"
result = text.split(',')
print(result)  # Виведе: ['apple', 'banana', 'cherry']



# string.join(iterable) string - рядок-роздільник, який буде вставлений між елементами послідовності.
# iterable - послідовність, список або кортеж рядків, які потрібно об'єднати

list_of_strings = ['Hello', 'world']
result = ' '.join(list_of_strings) #об'єднання послідовності рядків 
# (наприклад, списку або кортежу) в один рядок з використанням вказаного роздільника.
print(result)  # Виведе: 'Hello world'

elements = ['earth', 'air', 'fire', 'water']
result = ', '.join(elements)
print(result)  # Виведе: 'earth, air, fire, water'

clean = '   spacious   '.strip() # видалити зайві пробіли на початку і в кінці рядка
print(clean) # spacious
#" lstrip видаляє тільки пробіли на початку рядка;
# rstrip видаляє тільки пробіли в кінці рядка.


# str.replace(old, new, count=-1) count - лічильник максимальної кількості замін.
#  Якщо не вказано або вказано -1, замінюються всі входження.

text = "Hello world"
new_text = text.replace("world", "Python")
print(new_text)  # Hello Python

text = "one fish, two fish, red fish, blue fish"
new_text = text.replace("fish", "bird", 2)
print(new_text)   # one bird, two bird, red fish, blue fish

text = "Hello, world!"
new_text = text.replace(" world", "")
print(new_text) # Hello,!

print('TestHook'.removeprefix('Test')) # Hook 'Test', є префіксом рядка та буде видалене
print('TestHook'.removeprefix('Hook')) # TestHook 'Hook', це суфікс рядка і видалене не буде

print('TestHook'.removesuffix('Test')) # TestHook
print('TestHook'.removesuffix('Hook')) # Test



''' Написати код, який обробляє URL пошукового запиту, щоб видобути параметри запиту та перетворити
їх у формат, з яким легше працювати в Python. Коли ви вводите пошуковий запит у браузері,
він формує URL, де ваш запит та інші налаштування кодуються як ряд параметрів.
Наш код повинен "розпаковувати" ці параметри, перетворюючи їх на словник Python, 
де ми можемо легко отримати доступ до кожного параметра за його ім'ям.
Такий підхід часто використовується у веб-розробці та обробці даних для роботи з інформацією,
отриманою з інтернет-запитів.
'''
url_search = "<https://www.google.com/search?q=Cat+and+dog&ie=utf-8&oe=utf-8&aq=t>"
_, query = url_search.split('?') # ми використовуємо символ _ для ігнорування частини URL до ?
print(query) # q=Cat+and+dog&ie=utf-8&oe=utf-8&aq=t>

obj_query = {} # створюємо порожній словник
for el in query.split('&'): # розділяє рядок на окремі параметри за символом & та формує наступний список
                            # ['q=Cat+and+dog', 'ie=utf-8', 'oe=utf-8', 'aq=t']
    key, value = el.split('=') # розділяємо кожен параметр el на ключ та значення key, value 
    obj_query.update({key: value.replace('+', ' ')}) # замінюємо символи + на пробіли, бо у URL пробіли зазвичай кодуються як +
print(obj_query) # {'q': 'Cat and dog', 'ie': 'utf-8', 'oe': 'utf-8', 'aq': 't>'} 



number = "12345"
print(number.isdigit())  # перевірка, чи складається рядок повністю з цифр   True

text = "Number123"
print(text.isdigit())  # False


user_input = input("Введіть число: ")
if user_input.isdigit():
    print("Це дійсно число!")
else:
    print("Це не число!")


for char in "Hello 123":
    if char.isdigit():
        print(f"'{char}' - це цифра")
    else:
        print(f"'{char}' - не цифра")


'''Метод translate() в Python використовується для перетворення рядків шляхом заміни певних символів
іншими символами. 
Спочатку потрібно створити таблицю перекладу  за допомогою методу str.maketrans(),який приймає 
два аргументи: рядок символів, які потрібно замінити, та рядок символів, на які потрібно замінити.
Метод translate() також може використовуватися для видалення певних символів із рядка. 
Для цього передайте в maketrans() третій аргумент - рядок символів, які потрібно видалити.

Нормалізація тексту, це коли треба замінити або видалити специфічні символи.
Операції кодування та декодування - створення простих кодувань шляхом заміни символів.
Фільтрація тексту шляхом видалення небажаних символів, наприклад, пунктуації або цифр.
'''

intab = "aeiou"
outtab = "12345"
trantab = str.maketrans(intab, outtab)
str = "This is string example"
print(str.translate(trantab)) # Th3s 3s str3ng 2x1mpl2


intab = "aeiou"
trantab = str.maketrans('', '', intab) # видаляє всі літери на позначення голосних звуків із рядка
str = "This is string example"
print(str.translate(trantab)) # Ths s strng xmpl


'''Pозробити програму, яка конвертує рядок, що містить шістнадцяткові числа (як окремі символи),
 у відповідний двійковий код. Програма повинна обробляти як великі, так і малі літери 
 шістнадцяткових чисел і перетворювати кожен символ на його чотирибітове двійкове представлення.
'''

symbols = "0123456789ABCDEF" # рядок, що містить символи, які будуть перетворюватися
code = [
        '0000', '0001', '0010', '0011', '0100', '0101', '0110', '0111',
        '1000', '1001', '1010', '1011', '1100', '1101', '1110', '1111'
        ] # список рядків з двійковим кодом, який відповідає кожному символу в symbols
MAP = {}
for s, c in zip(symbols, code): # використовуємо zip(symbols, code), який створює пари символ-двійковий код
    MAP[ord(s)] = c # додаючи в MAP відповідність між Unicode кодом символу, за допомогою функції ord(s) та його двійковим кодом c
    MAP[ord(s.lower())] = c # Для кожного символу додається як його верхній, так і нижній регістр s.lower()
'''В нашому випадку ми отримаємо наступну таблицю перекладу MAP:
{
    48: "0000",
    49: "0001",
    50: "0010",
    51: "0011",
    52: "0100",
    53: "0101",
    54: "0110",
    55: "0111",
    56: "1000",
    57: "1001",
    65: "1010",
    97: "1010",
    66: "1011",
    98: "1011",
    67: "1100",
    99: "1100",
    68: "1101",
    100: "1101",
    69: "1110",
    101: "1110",
    70: "1111",
    102: "1111",
}

Функція ord() в Python - це вбудована функція, яка використовується для отримання Unicode коду 
символу. Коли ви працюєте з текстом в Python, кожен символ у рядку має відповідний числовий код 
- Unicode. Функція ord() приймає символ і повертає його Unicode код, який є цілим числом.
'''

result = "34 DF 56 AC".translate(MAP) # використовуємо метод translate() для перетворення рядка
                                      # "34 DF 56 AC" відповідно до нашої таблиці перекладу MAP. 
                                      # Метод кожен символ у вихідному рядку замінює на його 
                                      # двійкове представлення згідно з MAP
print(result) # 00110100 11011111 01010110 10101100



'''Розробити програму, яка перетворює вхідний текстовий рядок на відповідний код мови Морзе'''

morze_dict = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
              'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..',
              'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
              'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
              'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---',
              '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...',
              '8': '---..', '9': '----.'}

# Перетворення ключів словника на Unicode коди
table_morze_dict = {}

for k, v in morze_dict.items():
    table_morze_dict[ord(k)] = v # функція ord(k) додає до словника table_morze_dict
                                # Unicode ключі та відповідні коди Морзе - значеннями.
string = "Hello world"
result = ""

for ch in string:
    result = result + ch.upper().translate(table_morze_dict) # За допомоги методу ch.upper() 
    # перетворюємо символ у верхній регістр, щоб відповідати ключам у таблиці table_morze_dict

print(result) # ......-...-..--- .-----.-..-..-..



# вивести числа від 0 до 7 в десятковому, шістнадцятковому, вісімковому і двійковому представленні:
for i in range(8):
    s = f"int: {i:d};  hex: {i:#x};  oct: {i:#o};  bin: {i:#b}"
    print(s)
'''int: 0;  hex: 0x0;  oct: 0o0;  bin: 0b0
int: 1;  hex: 0x1;  oct: 0o1;  bin: 0b1
int: 2;  hex: 0x2;  oct: 0o2;  bin: 0b10
int: 3;  hex: 0x3;  oct: 0o3;  bin: 0b11
int: 4;  hex: 0x4;  oct: 0o4;  bin: 0b100
int: 5;  hex: 0x5;  oct: 0o5;  bin: 0b101
int: 6;  hex: 0x6;  oct: 0o6;  bin: 0b110
int: 7;  hex: 0x7;  oct: 0o7;  bin: 0b111
'''

 # Форматування за допомогою виразів у f-рядках дозволяє не тільки вставляти значення змінних у рядок
 # , а й форматувати ці значення за допомогою спеціальних вказівок.

price = 19.99
quantity = 3
total = f"Total: {price * quantity:.2f}" # форматування :.2f для відображення дійсного числа 
                                         # з двома цифрами після десяткового розділювача
print(total) # Total: 59.97
''' У виразі :.2f  : вводить специфікацію формату.
                  .2 означає, що після десяткової крапки має бути виведено дві цифри.
                   f вказує на формат дійсного числа.
Цей формат дуже корисний при виведенні грошових сум, наукових даних,
де потрібна точність до певного числа знаків після коми.'''



'''відформатувати рядок так, щоб знаки на різних рядках були один під одним (додати пробілів),
додати заповнення в рядки для того, щоб результат був завжди однієї і тієї самої довжини,
вивести квадрати та куби чисел до 12 у вигляді таблиці, відцентрувавши значення у стовпцях по 10 символів шириною'''

width = 5
for num in range(12):
    print(f'{num:^10} {num**2:^10} {num**3:^10}')
'''    0          0          0     
    1          1          1     
    2          4          8     
    3          9          27    
    4          16         64    
    5          25        125    
    6          36        216    
    7          49        343    
    8          64        512    
    9          81        729    
    10        100        1000   
    11        121        1331
'''

'''Мета роботи з метамовою форматування полягає у зазначенні в фігурних дужках,
 яким чином варто перетворити значення перед тим як підставити його в рядок.
 
Ширина поля вказує мінімальну ширину поля, в яке буде поміщено вміст. 
Якщо вміст коротший за ширину поля, він буде доповнений пробілами.

Вирівнювання визначає, як вміст буде вирівняний всередині вказаної ширини поля. 
Можливі варіанти вирівнювання:

<: Вирівнювання вмісту по лівому краю.
>: Вирівнювання вмісту по правому краю.
^: Вирівнювання вмісту по центру.
=: Використовується для вирівнювання чисел, при цьому знак (якщо він є) відображається зліва,
   число - по правому краю поля. '''

name = "Alice"
formatted = f"{name:>10}"
print(formatted)  # '     Alice' (вирівнювання праворуч) Виведення з 5-ма пробілами ліворуч



'''форматування відсотків за допомогою f-рядків, що дозволяє зручно відображати числа як відсотки. 
Для цього використовується специфікатор формату %, який множить число на 100 і додає символ відсотка 
% до рядка. Це особливо корисно при роботі з даними, де потрібно представляти частки або пропорції
у форматі відсотків.    

f"{value:<ширина>.<точність>%} де:
value - значення, яке потрібно перетворити у відсотки.
<ширина> - загальна ширина поля; необов'язково.
<точність> - кількість знаків після десяткової крапки; необов'язково."
'''

completion = 0.756
formatted = f"{completion:.1%}"
print(formatted)  # Виведе: '75.6%'

progress = 0.5
formatted = f"{progress:.0%}"
print(formatted) # 50%




'''Регулярні вирази (regular expressions, часто скорочують як regex або regexp) - 
це потужни інструмент для роботи з текстом, який дозволяє шукати, замінювати або витягувати
певні шаблони в тексті за допомогою спеціального синтаксису

Основні компоненти регулярних виразів включають:

Літерали. Пряме відображення символів (наприклад, a, B, 1).

Метасимволи. Символи, які мають спеціальне значення в регулярних виразах 
(наприклад, . (крапка) відповідає будь-якому символу).

Квантифікатори. Визначають, скільки разів елемент повинен відповідати 
(наприклад * означає 0 або більше повторень).

Класи символів. Визначають групи символів 
(наприклад, [a-z] відповідає будь-якій малій літері).

Групи та діапазони. Використовуються для групування частин виразу 
(наприклад, (abc) визначає групу символів).

Альтернації. Відповідає одному з декількох шаблонів (наприклад, a|b відповідає a або b).

Якорі. Визначають позиції у тексті (наприклад, ^ для початку рядка, $ для кінця рядка).


Для роботи з регулярними виразами в Python використовується модуль re.
Основні функції модуля re які ми розглянемо далі це:

re.search(pattern, string) - виконує пошук першого входження шаблону в рядку.
re.findall(pattern, string) - виконує знаходження всіх входжень шаблону в рядку.
re.sub(pattern, repl, string) - виконує заміну входжень шаблону на інший рядок.
re.split(pattern, string) виконує розбивання рядка за шаблоном.


Регулярні вирази використовують спеціальні символи для створення шаблонів. 
Вони складаються з блоків та модифікаторів.

Прикладом блоку може бути:

\w — будь-яка цифра або буква [a-zA-Z0-9_] (\W — все, крім букви або цифри [^a-za-z0-9_])
\d — будь-яка цифра [0-9] (\D — усе, крім цифри [^0-9])
\s — будь-який пробільний символ [\t\n\r\f\v] (\S — усе, крім пробільних символів [^\t\n\r\f\v])
\b — межа слова
[...] — один із символів у дужках ([^ ] — будь-який символ, крім тих, що в дужках)
^ і $ — початок і кінець рядка відповідно
( ) — групує вираз і повертає знайдений текст
\t, \n, \r — символ табуляції, нового рядка та повернення каретки


Модифікатори можуть вказувати на кількість повторень блоку у виразі, наприклад:

. — один будь-який символ, крім рядка \n
? — 0 або 1 входження шаблону зліва
+ — 1 і більше входжень шаблону зліва
* — 0 і більше входжень шаблону зліва
\ — екранування спеціальних символів (приклад: \. — означає крапку або \+ — знак "плюс")
{n} суворо n разів (n ціле число)
{n,m} — від n до m входжень (приклад: {,m} — від 0 до m)
a|b — відповідає a або b. Сам символ | означає "або" між двома шаблонами
( ) — групує вираз і повертає знайдений текст
'''

'''re.search(pattern, string)
pattern: Регулярний вираз (шаблон), який ви хочете знайти.
string: Рядок, у якому ви хочете знайти шаблон.

Результат виконання re.search() це спеціальний об'єкт Match, якщо знаходить відповідність. 
Якщо відповідність не знайдена, повертає None.

Об'єкт Match має властивості та методи, що використовуються для отримання інформації 
про пошук та результат:
Match.span() повертає кортеж, що містить початкову та кінцеву позиції збігу.
Match.string повертає рядок, переданий у функцію,
Match.group() повертає частину рядка, в якому був збіг
'''

import re

text = "Вивчення Python може бути веселим."
pattern = "Python"
match = re.search(pattern, text)
if match:
    print("Знайдено:", match.group())
else:
    print("Не знайдено.") # Знайдено: Python


pattern = r"в\w*м" 
# r означає "сирий" рядок (raw string), який каже Python ігнорувати спеціальні символи 
# такі як \n, \t тощо, оскільки це рядок для регулярних виразів.
#в - шукаємо слово яке починається на букву "в".
#\w* - це означає будь-яка кількість букв включно з нулем букв.
# Бо \w відповідає будь-якому "словесному" символу, а * є квантифікатором,
# який означає "нуль або більше входжень попереднього елемента".
#м - шукаємо слово яке закінчується на "м".
match = re.search(pattern, text, re.IGNORECASE)
if match:
    print("Знайдено:", match.group()) #Знайдено: веселим


text = "Моя електронна адреса: example@example.com"
pattern = r"\w+@\w+\.\w+"
# \w+ - спочатку повинні йти одна або більше букв або цифр.
#@ - далі обов'язково повинен бути символ @.
#\. - серія букв повинна закінчитись символом крапки. Ми екрануємо його, бо в регулярному виразі,
#крапка є модифікатором та має спеціальне значення.
match = re.search(pattern, text)
if match:
    print("Електронна адреса:", match.group()) #Електронна адреса: example@example.com



'''Припустимо, у нас є рядок з електронною адресою, і ми хочемо вилучити ім'я користувача 
та домен цієї електронної адреси окремо. Треба розділити "username@domain.com" на "username" 
(ім'я користувача) та "domain.com" (домен).'''

email = "username@domain.com"
pattern = r"(\w+)@(\w+\.\w+)"
match = re.search(pattern, email)
if match:
    user_name = match.group(1)
    domain_name = match.group(2)
    print("Ім'я користувача:", user_name) # Ім'я користувача: username
    print("Домен:", domain_name) #Домен: domain.com



text = "Рік 2023 був складнішим, ніж 2022"
pattern = r"\d+" # регулярний вираз \d+ знаходить одну або більше цифр у рядку підряд 
matches = re.findall(pattern, text)
print(matches) # ['2023', '2022']


text = "Python - це проста, але потужна мова програмування."
pattern = r"\w+"
matches = re.findall(pattern, text)
print(matches)  # ['Python', 'це', 'проста', 'але', 'потужна', 'мова', 'програмування']


text = "Контакти: example1@example.com, example2@sample.org"
pattern = r"\w+@\w+\.\w+"
matches = re.findall(pattern, text)
print(matches)  # Виведе всі знайдені електронні адреси ['example1@example.com', 'example2@sample.org']



'''re.sub(pattern, repl, string)
pattern - регулярний вираз, який вказує на частину рядка, яку потрібно замінити.
repl - рядок, на який буде замінено збіги.
string - рядок, в якому відбувається заміна.'''


file_name = "Мій документ Python.txt"
pattern = r"\s" # \s відповідає будь-якому пробільному символу
replacement = "_"
formatted_name = re.sub(pattern, replacement, file_name)
print(formatted_name)  # Мій_документ_Python.txt


text = "Python - потужна, універсальна; мова!"
pattern = r"[;,\-:!\.]"
replacement = ""
modified_text = re.sub(pattern, replacement, text)
print(modified_text)  # Python  потужна універсальна мова


phone = """
        Михайло Куліш: 050-171-1634
        Вікторія Кущ: 063-134-1729
        Оксана Гавриленко: 068-234-5612
        """
pattern = r"(\d{3})-(\d{3})-(\d{4})"
replacement = r"(\1) \2-\3"
formatted_phone = re.sub(pattern, replacement, phone)
print(formatted_phone) # Михайло Куліш: (050) 171-1634 Вікторія Кущ: (063) 134-1729 Оксана Гавриленко: (068) 234-5612




text = "Python - це проста, але потужна мова програмування."
pattern = r"\s+"
words = re.split(pattern, text)
print(words)  # ['Python', '-', 'це', 'проста,', 'але', 'потужна', 'мова', 'програмування.']


text = "Python - потужна; проста, універсальна: мова!"
pattern = r"[;,\-:!\s]+"
elements = re.split(pattern, text)
print(elements)  # ['Python', 'потужна', 'проста', 'універсальна', 'мова', '']


text = "apple#banana!mango@orange;kiwi"
pattern = r"[#@;!]" # [#@;!] створює набір символів, який включає #, @, ;, і !, кожен з яких може бути використаний як роздільник
fruits = re.split(pattern, text)
print(fruits) # ['apple', 'banana', 'mango', 'orange', 'kiwi']


