"""
імена, вказані при оголошенні функції, називаються параметрами (змінні, які використовуються всередині функції), 
тоді як значення, які ви передаєте у функцію при її виклику, – аргументами.
"""

'''починаючи з версії Python 3.5, ви можете використовувати "type hints" (підказки типів) 
для вказівки очікуваних типів параметрів

Типізація в Python є опціональною та не впливає на виконання коду в рантаймі (run-time), 
але вона може бути корисною для розробників. 

функція вміє повертати деякий результат своєї роботи, а процедура нічого не повертає
та результатом її роботи може бути зміна стану змінних, які вже існують
'''

def print_max(a: int, b: int):
    if a > b:
        print(a, 'максимально')
    elif a == b:
        print(a, 'дорівнює', b)
    else:
        print(b, 'максимально')

print_max(3, 4)  # пряма передача значень

x = 5
y = 7
print_max(x, y)  # передача змінних як аргументів


'''
ReturnType вказує на тип даних, який функція має повертати. 

def my_function() -> ReturnType:
    # виконати дії
    return result
'''

def add_numbers(num1: int, num2: int) -> int:
    sum = num1 + num2
    return sum
result = add_numbers(5, 10)
print(result)  # Виведе: 15



def greet(name: str) -> str:
    return f"Привіт, {name}!"
greeting = greet("Олексій")
print(greeting)  # Виведе: Привіт, Олексій!


def is_even(num: int) -> bool:
    return num % 2 == 0
check_even = is_even(4)
print(check_even)  # Виведе: True


'''Незмінні (immutable) типи в Python — це ті, що не можуть бути змінені після їх створення. 
Це включає типи, як-от цілі числа int, дійсні числа float, рядки str, кортежі tuple.

Коли незмінний об'єкт передається у функцію, фактично передається його копія, 
і будь-які зміни цього об'єкту в функції не впливають на оригінальний об'єкт.'''


def modify_string(original: str) -> str:
    original = "змінено"
    return original

str_var = "оригінал"
print(modify_string(str_var))  # виведе: змінено
print(str_var)                # виведе: оригінал


'''Змінні (mutable) типи, як списки list, словники dict, множини set, можуть змінюватися. 
Коли змінний об'єкт передається у функцію, передається посилання на цей об'єкт, 
і зміни, зроблені всередині функції, відображаються на оригінальному об'єкті.'''

def modify_list(lst: list) -> None:
    lst.append(4)

my_list = [1, 2, 3]
modify_list(my_list)
print(my_list)  # виведе: [1, 2, 3, 4]


'''Використовуйте метод copy() для створення копій змінних об'єктів, 
якщо не хочете змінювати оригінал.'''

def modify_list(lst: list) -> None:
    lst = lst.copy()
    lst.append(4)

my_list = [1, 2, 3]
modify_list(my_list)
print(my_list)  # виведе: [1, 2, 3]



'''ASCII (акронім від назви  American Standard Code for Information Interchange)
 в обчислювальній техніці — система кодів, у якій числа від 0 до 127 включно поставлені
 у відповідність літерам, цифрам і символам пунктуації.
 Наприклад, 45 відповідає знаку переносу, а 65 — літері «А» великій.
 Система використовується для зберігання тексту і передачі інформації між комп'ютерами.
 
 вбудована функція ord() приймає один символ і повертає його код ASCII.
 '''

def string_to_codes(string: str) -> dict:
    # Ініціалізація словника для зберігання кодів
    codes = {}  
    # Перебір кожного символу в рядку
    for ch in string:  
        # Перевірка, чи символ вже є в словнику
        if ch not in codes:
            # Додавання пари символ-код в словник  
            codes[ch] = ord(ch)  
    return codes

result = string_to_codes("Hello world!")
print(result) # {'H': 72, 'e': 101, 'l': 108, 'o': 111, ' ': 32, 'w': 119, 'r': 114, 'd': 100, '!': 33}

'''Область видимості — це область у програмі (коді), в межах якої ви можете звернутися за 
ім'ям до вмісту змінної. Ці області видимості діляться на чотири рівні в порядку пошуку
імен змінних, та відомі як LEGB-правило:
L - Local (Локальна): Це внутрішній рівень, де ім'я визначено всередині функції або блоку коду.
E - Enclosing (Охоплювана): Це область видимості, яка охоплює локальну область видимості.
 Якщо функція знаходиться всередині іншої функції, імена, визначені в охоплюваній функції, 
 будуть доступні для внутрішньої функції.
G - Global (Глобальна): Це область видимості на рівні модуля або сценарію.
 Змінні, визначені на цьому рівні, доступні у всьому модулі.
B - Built-in (Вбудована): Це самий зовнішній рівень, який містить імена, вбудовані в Python.
 Наприклад  вбудовані функції, len, range тощо.'''

x = 50

def func() -> None:
    x = 2
    print('Зміна локального x на', x)  # Зміна локального x на 2
func()
print('Глобальний x як і раніше', x)  # x як і раніше 50


def func_outer():
    x = 2
    def func_inner():
        nonlocal x
        x = 5
    func_inner()
    return x
result = func_outer()  # 5


def func():
    global x
    print('x дорівнює', x)  # x дорівнює 50
    x = 2
    print('Змінюємо глобальне значення x на', x)  # Змінюємо глобальне значення x на 2
func()
print('Значення x складає', x)# Значення x складає 2

'''Ключові аргументи функції - якщо є деяка функція з великою кількістю параметрів, 
і при її виклику вимагається вказати тільки деякі з них,
значення цих параметрів можуть задаватися за їх ім'ям.
  
Значеннями за замовчуванням можуть бути забезпечені тільки параметри, 
що знаходяться у кінці списку параметрів.  '''

def greet(name, message="Привіт"):
    print(f"{message}, {name}!")
# використовує значення за замовчуванням для message
greet("Олексій")  #Привіт, Олексій!
# передача власного значення для message
greet("Марія", message="Добрий день")  # Добрий день, Марія!


def func(a, b=5, c=10):
    print('a дорівнює', a,', b дорівнює', b,', а c дорівнює', c)
# a дорівнює 3, b дорівнює 7, а c дорівнює 10
func(3, 7)
# a дорівнює 25, b дорівнює 5, а c дорівнює 24
func(25, c=24)
# a дорівнює 100, b дорівнює 5, а c дорівнює 50
func(c=50, a=100)


def say(message, times=1):
    print(message * times)
say('Привіт') 
say('Світ', 5)



def real_cost(base: int, discount: float = 0) -> float:
    return base * (1 - discount) #Якщо знижка відсутня, то використовується лише базова ціна

price_bread = 15
price_butter = 50
price_sugar = 60

current_price_bread = real_cost(price_bread)
current_price_butter = real_cost(price_butter, 0.05)
current_price_sugar = real_cost(price_sugar, 0.07)

print(f'Нова вартість хліба: {current_price_bread}') # Нова вартість хліба: 15
print(f'Нова вартість масла: {current_price_butter}') # Нова вартість масла: 47.5
print(f'Нова вартість цукру: {current_price_sugar}') # Нова вартість цукру: 55.8


'''Змінна кількість параметрів

Параметр *args. Він дозволяє функції приймати довільну кількість позиційних аргументів.
Аргументи, передані функції, зберігаються у вигляді кортежу.

Параметр **kwargs (keyword arguments) Він дозволяє функції приймати довільну кількість ключових аргументів. 
Але аргументи, передані функції, зберігаються вже у вигляді словника.

коли ви використовуєте обидва ці параметри разом, *args має йти перед **kwargs

всі позиційні аргументи, передані після останнього визначеного аргументу,
будуть упаковані в кортеж (словник) під ім'ям,
що йде після символу * (**) і зазвичай це ім'я args (kwargs), але може бути будь-яке інше ім'я
'''

def print_all_args(*args):
    for arg in args:
        print(arg)

print_all_args(1, 'hello', True)



def concatenate(*args) -> str:
    result = ""
    for arg in args:
        result += arg
    return result

print(concatenate("Hello", " ", "world", "!"))



def greet(**kwargs):
    for key, value in kwargs.items():
        print(f"{key}: {value}")

greet(name="Alice", age=25) # {'name': 'Alice', 'age': 25}


def example_function(*args, **kwargs):
    print("Позиційні аргументи:", args)
    print("Ключові аргументи:", kwargs)

example_function(1, 2, 3, name="Alice", age=25) # Позиційні аргументи: (1, 2, 3) Ключові аргументи: {'name': 'Alice', 'age': 25}


'''Розпакування списків та словників дозволяє присвоїти значення зі списку або словника
до змінних одним рядком коду.

 Розпакування словників часто використовується для передачі іменованих аргументів у функції,
особливо коли кількість аргументів або їхні імена не відомі заздалегідь.'''

my_list = [1, 2, 3]
a, b, c = my_list #присвоїти елементи списку окремим змінним
a, _, c = my_list #ігнорувати деякі з елементів списку під час розпакування, можна використовувати _
a, *rest = my_list #розпакувати частину списку, використовуючи *


def greet(name, age):
    print(f"Hello {name}, you are {age} years old.")

person_info = {"name": "Alice", "age": 25} 
greet(**person_info) #Розпакування словників використовується під час передачі аргументів у функцію.


'''Рекурсія — це концепція в програмуванні, коли функція викликає саму себе в рамках власного виконання.
Це схоже на дроблення великої проблеми на менші, керованіші проблеми.

обчислення факторіала числа або чисел Фібоначчі

основні компоненти рекурсії:
Базовий випадок: Це умова, при якій рекурсія припиняє виклик самої себе, 
щоб уникнути нескінченного циклу. Він важливий для запобігання нескінченному циклу в рекурсії.
Рекурсивний випадок: Це умова, за якої функція викликає саму себе з новими аргументами.
Фактично це ситуація, коли функція продовжує викликати саму себе, розбиваючи проблему на менші частини

Якщо рекурсивні виклики функції продовжуються без досягнення базового випадку, 
стек викликів може переповнитись, що призведе до помилки виконання.
Така помилка називається переповненням стеку (stack overflow)
Щоб цьому запобігти, інтерпретатори примусово завершують роботу програми після досягнення ліміту викликів функцій, 
які не повертають результат. Така межа називається максимальною глибиною рекурсії, або максимальним розміром стеку викликів.
У Python граничним значенням вважається 1000 викликів функцій.
'''

'''Числа Фібоначчі — це послідовність чисел, у якій кожне наступне число є сумою двох попередніх.
 Перші два числа в цій послідовності, за визначенням, дорівнюють 0 і 1.
'''

def fibonacci(n):
    if n <= 1: # базовий випадок
        return n
    else:
        return fibonacci(n-1) + fibonacci(n-2) # рекурсивний випадок

print(fibonacci(10)) # виведе 55



'''Факторіал натурального числа n (позначається як n!) —
це добуток всіх натуральних чисел від 1 до n включно.

Цей код працює тому, що кожен виклик factorial(n-1) працює на дедалі меншому числі 
аж до того моменту, коли n дорівнює 0, і відбувається базовий випадок.
На цьому етапі рекурсія завершується, і результат починає "повертатися" назад 
через усі попередні виклики функції, обчислюючи добуток на кожному кроці.'''

def factorial(n):
    if n == 0: # базовий випадок
        return 1
    else:
        return n * factorial(n-1) # рекурсивний випадок
print(factorial(5)) # виведе 120   5 * 4 * 3 * 2 * 1 = 120. 

'''Стек викликів — це специфічна частина пам'яті, яка використовується для зберігання інформації
 про активні виклики функцій. Кожен раз, коли функція викликається, створюється новий запис 
 (або "шар") у цьому стеку для цього конкретного виклику. Цей шар містить інформацію 
 про змінні функції, її параметри та місце, звідки була викликана функція, 
 щоб після завершення виконання функції програма могла продовжити роботу з правильного місця.'''

def factorial(n):
    print("Виклик функції factorial з n = ", n)
    if n == 1:
        print("Базовий випадок, n = 1, повернення 1")
        return 1
    else:
        result = n * factorial(n-1)
        print("Повернення результату для n = ", n, ": ", result)
        return result

print(factorial(5)) 





