# '''У Python модуль - це файл, який містить всілякі визначення такі, як функції, 
# класи, змінні тощо. Модуль може містити будь-який корисний код, і його основна мета - 
# допомогти у структуризації та організації коду.

# Імпортування у Python відбувається за допомогою ключового слова import,
# після якого ви можете вказати один або декілька пакетів, які ви хочете імпортувати.

# Для того щоб викликати функцію з імпортованого пакету, потрібно вказати ім'я пакету і 
# через крапку ім'я функції або константи в цьому пакеті.
# Є й інший спосіб: можна імпортувати з пакета тільки те, що нам необхідно за допомогою виразу 
# from ... import ...
# імпортувати весь вміст модуля за допомогою інструкції from <module_name> import * 
# може здатися зручним, але не рекомендується
# '''
# import math
# sin_pi = math.sin(math.pi)

# from math import pi, sin
# sin_pi = sin(pi)

# '''Модулем Python є будь-який текстовий файл з розширенням py, який містить код мовою Python. 
# Кожен модуль має свій простір імен, що відокремлює його визначення від інших модулів. 
# якщо в іншому модулі існує функція з такою ж назвою, це не призведе до конфлікту.
# '''
# # mymodule.py
# def say_hello(name):
#     return f"Hello, {name}!"

# # main.py
# import mymodule 
# #Тут mymodule.say_hello("World") викликає функцію say_hello з модуля mymodule всередині 
# #скрипту main.py.
# print(mymodule.say_hello("World"))

# # main.py
# from mymodule import say_hello as greeting #  надаємо їй псевдонім (alias) greeting 
# # можемо змінити назву функції say_hello всередині main.py, 
# # коли імпортуємо її з модуля mymodule.py
# print(greeting("World"))

# from module_name import item_name as alias

# '''Коли ви використовуєте оператор import для завантаження модуля, 
# Python шукає відповідний файл .py за допомогою визначеного порядку пошуку.
# Перш за все, Python шукає модуль у директорії, з якої запускається виконавчий скрипт 
# (або поточній робочій директорії, якщо інтерпретатор запущений інтерактивно).

# Далі пошук відбувається в змінній оточення PYTHONPATH. 
# Це змінна оточення, яка містить список директорій, що Python переглядає під час пошуку модулів.

# Змінні оточення під час запуску програми використовуються для забезпечення конфіденційності 
# даних, налаштування конфігурації та адаптації поведінки програми до різних середовищ. 
# Ці змінні є частиною оточення, в якому виконується програма, і можуть бути встановлені 
# або змінені на рівні операційної системи, командного рядка або безпосередньо у коді програми.

# Якщо модуль не було знайдено, то Python, в кінці, перевіряє директорії, які були визначені 
# під час його інсталяції. Ці директорії зазвичай включають місця, де знаходяться стандартні 
# бібліотеки Python.
# '''
# '''Функція dir() тримання переліку атрибутів (включно з методами) об'єкта чи модуля. 
# Це корисно для розуміння того, що доступно в модулі після його імпортування:
# dir(module_name): Повертає список атрибутів, визначених у модулі module_name.
# Без аргументів, dir() повертає список атрибутів з поточної області визначень.'''

# # main.py
# from mymodule import say_hello as greeting
# print(dir()) # ['__annotations__', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', 
# # 'greeting'] Hello, World!
# print(greeting("World"))

# '''В таких випадках нам може допомогти службова змінна Python: __name__. 
# якщо скрипт викликаний безпосередньо, то він є "точкою входу" та __name__ == "__main__". 
# Якщо ж цей модуль виконується під час імпорту, то __name__ == "mymodule" для модуля, 
# який називається mymodule.py.'''

# # під час імпорту модуля Python виконує увесь код, що міститься в модулі.
# def say_hello(name):
#     print(f'Hello, {name}')
# print("You imported hello.py")
# say_hello('user')
# # main.py
# from mymodule import say_hello as greeting
# print(greeting("World")) # You imported hello.py    Hello user    Hello, World!


# def say_hello(name):
#     print(f'Hello, {name}')
# if __name__ == '__main__':
#     print("You imported hello.py")
#     say_hello('user')
# # весь код, який потрібно виконати, коли модуль викликається із консолі (не імпортується),
# # поміщати у функцію main
# def say_hello(name):
#     print(f'Hello {name}')
# def main(): # функцію main ще називають "точкою входу", оскільки робота застосунку починається
#             # з виклику цієї функції (можете назвати цю функцію як завгодно)
#     print("You imported hello.py")
#     say_hello('user')
# if __name__ == '__main__':
#     main()


# '''Модуль sys в Python є частиною стандартної бібліотеки і надає доступ до деяких змінних та
# функцій, що взаємодіють із інтерпретатором Python, використовується для отримання інформації
# про середовище, в якому працює програма, і для взаємодії з системою на нижчому рівні.
# забезпечує доступ до змінних і функцій, пов'язаних із самим Python і операційною системою, 
# на якій він встановлений. 

# sys.argv - список аргументів командного рядка, переданих скрипту Python. 
# Елемент argv[0] є ім'ям скрипту, а інші елементи – це додаткові аргументи командного рядка.
# sys.exit() - функція виходу з Python. Ви можете передати числовий аргумент, що стане статусом 
# виходу програми. Прийнято, що аргумент 0 означає успішне завершення, 
# а ненульові значення вказують на помилку.
# sys.path - список рядків, який визначає шлях пошуку інтерпретатора для модулів. 
# Ви можете модифікувати цей список, щоб додати власні шляхи для пошуку модулів.
# sys.version - рядок, що містить інформацію про версію Python, яка використовується.
# sys.platform - рядок, що вказує на ім'я платформи, на якій виконується Python 
# (наприклад, 'linux' для Linux, 'win32' для Windows).
# sys.modules - словник, який містить завантажені модулі. 
# Ключі – це назви модулів, а значення – це об'єкти модулів.'''

# import sys
# import os
# print(sys.modules["os"]) #<module 'os' from 'C:\\Users\\Krabat\\AppData\\Local\\Programs\\Python\\Python310\\lib\\os.py'>

# print(sys.modules.keys())#dict_keys(['sys', 'builtins', '_frozen_importlib', '_imp', '_thread', '_warnings', '_weakref', '_io'])

# # список модулів, вбудованих у мову
# print(sys.builtin_module_names)#('_abc', '_ast', '_bisect', '_blake2', '_codecs', '_codecs_cn', '_codecs_hk', '_codecs_iso2022')

# '''Щоб перевірити, за якими шляхами інтерпретатор шукатиме модулі, виведіть sys.path
# На початку імпорту проглядається робоча директорія проєкту, а потім вже стандартна бібліотека.
# Це означає, що якщо ви назвете свій скрипт random.py і спробуєте виконати import random, 
# то буде імпортовано ваш скрипт, а не бібліотека, вбудована в Python.
# '''
# import sys
# #Під час виклику такого скрипту командою  python arg.py 123 
# def main():
#     if len(sys.argv) > 1:
#         print(sys.argv[1]) # 123
# if __name__ == "__main__":
#     main()



# '''Пакет — це директорія, що містить модулі Python. Розташовуючи модулі у директоріях, 
# ви можете структурувати модулі за призначенням
# Основне правило — це називати пакети та модулі так само, як і змінні Python 
# (тільки літери, цифри та _ , ім'я не починається з цифри)

# 📦example_pkg
#  ┣ 📂calculations
#  ┃ ┗ 📜salary_calculations.py
#  ┗ 📜main.py
# '''
# #salary_calculations.py
# def add_bonus(salary: int, bonus: int) -> int:
#     return salary + bonus
# #main.py
# from calculations import salary_calculations
# salary = 1000
# bonus = 15
# salary_with_bonus = salary_calculations.add_bonus(salary, bonus)
# print(salary_with_bonus)  # 1015

# from calculations.salary_calculations import add_bonus
# salary = 1000
# bonus = 15
# salary_with_bonus = add_bonus(salary, bonus)
# print(salary_with_bonus)  # 1015



# '''У версіях Python до 3.3 в пакетах обов'язково потрібно було розмістити 
# допоміжний файл __init__.py. Якщо цього не зробити, то Python не сприймав директорію 
# як пакет та імпортувати з такої директорії нічого не міг. Зараз в цьому немає потреби,
#  але часто такі файли створюються для зворотної сумісності зі старими версіями.

# Файл __init__.py — це службовий файл, який інтерпретатор обов'язково виконає під час 
# першого імпорту пакету. Таким чином, якщо вам потрібно виконати якісь дії під час імпорту 
# пакету, ви можете прописати їх у __init__.py.

# Файл __init__.py не використовується для ініціалізації інтерпретатора, 
# автоматичного запуску скриптів чи конфігурації віртуального оточення. 
# Його основна роль - вказувати, що директорія є Python пакетом, що дозволяє використовувати її 
# вміст як модулі.

#  📦example_init
#  ┣ 📂utility
#  ┃ ┣ 📂dummy
#  ┃ ┃ ┗ 📜functions.py
#  ┃ ┣ 📂useful
#  ┃ ┃ ┗ 📜functions.py
#  ┃ ┗ 📜__init__.py
#  ┗ 📜main.py
# '''
#  # Якщо залишити файл __init__.py порожнім, то використання функцій nice_function та not_bad 
# import utility
# utility.useful.functions.nice_function()
# utility.dummy.functions.not_bad("Test string")

# # Якщо ж розробник подумав про користувача то __init__.py має виглядає ось так:
# from utility.useful.functions import nice_function
# from utility.dummy.functions import not_bad
# __all__ = ['nice_function', 'not_bad']
# # Тепер можна скористатися таким імпортом функцій з пакету:
# from utility import nice_function, not_bad
# nice_function()
# not_bad("Test string")


# '''константа __all__ — це список модулів або пакетів, які імпортуються, якщо у виразі 
# from ... import * в кінці вказаний символ *.'''



# '''Пакетний менеджер pip є інструментом, який дозволяє вам встановлювати, оновлювати 
# та видаляти бібліотеки та інструменти, що використовуються в програмуванні на Python.

#  За допомогою pip ви маєте доступ до тисяч бібліотек, доступних 
#  на PyPI (Python Package Index), офіційному сховищі бібліотек Python.

# Використання pip передбачає виконання його як скрипту Python з аргументами під час виклику.
# Наприклад, щоб вивести список встановлених пакетів:
# python -m pip list
# або
# pip list
# Значення -m вказує, що потрібно викликати пакет як скрипт, що виконується, list — це аргумент,
# за яким pip "розуміє", що потрібно зробити (вивести список встановлених пакетів).

# Щоб уникнути проблем із залежностями, і встановлення потрібних для якогось проєкту пакетів 
# не впливала на всю вашу операційну систему та інші проєкти, рекомендується використати 
# віртуальне оточення Python.
# Оскільки пакет у Python — це директорії з файлами-модулями, ми можемо створити 
# окрему директорію для пакетів-залежностей всередині кожного проєкту. Якщо вказати Python, 
# що працюючи в директорії проєкту, імпортувати пакети потрібно саме з цієї директорії, 
# то тоді ми зможемо ізолювати в операційній системі наші проєкти один від одного. 
# Така директорія з пакетами-залежностями — це і є віртуальне оточення.

# venv — це вбудований в Python консольний скрипт.

# Щоб створити нове віртуальне оточення, виконайте наступні кроки:
# Відкрийте термінал або командний рядок.
# Перейдіть до директорії, де ви хочете створити свій Python проєкт.
# Виконайте наступну команду для створення віртуального оточення:

# python -m venv .venv   або python -m venv <назва_директорії>

# Це створить директорію .venv у поточній директорії, яка міститиме віртуальне оточення.
# Після виконання цієї команди у директорію .venv буде скопійований Python з мінімальним 
# набором стандартних пакетів. І ви зможете використати цей Python окремо від основного 
# системного або будь-якого іншого.
# Щоб почати використовувати Python з віртуального оточення, виконайте активацію віртуального оточення. 
# На Windows у командному рядку (Bash):

# команда використовується для активації віртуального оточення в Windows?

# <назва_директорії>\Scripts\activate.bat     або       source .venv/Scripts/activate

# Тепер після активації в цій консолі виклик python буде викликати не системний Python, 
# а версію з директорії .venv зі своїми пакетами.
# Активувавши віртуальне оточення, ви можете встановлювати/видаляти пакети за допомогою pip 
# у віртуальному оточенні. Встановлення/видалення пакетів впливає тільки 
# на віртуальне оточення і не зачіпає систему або інші проєкти.
# Щоб встановити необхідні бібліотеки в межах цього віртуального оточення, 
# використовуйте :

# pip install package_name

# Ці встановлені бібліотеки будуть ізольовані від глобального середовища Python.
# Щоб повернутися до системного Python, виконайте в консолі:

# deactivate

# Це поверне вас до глобального середовища Python.
# Щоб видалити віртуальне оточення, достатньо фізично видалити директорію .venv з усім її вмістом в директорії проєкту.
# '''

# # python -m venv <назва_директорії> або  source .venv/Scripts/activate
# # pip install colorama
# '''Colorama - це популярна бібліотека Python, яка використовується для додавання кольорів 
# до тексту в консолі.


# Команда pip freeze використовується для відображення списку всіх встановлених пакетів 
# та їх версій у поточному Python середовищі. 

# як зрозуміти які пакети встановлені в нашому віртуальному середовищі? 
# Для цього існує файл requirements.txt який використовується для визначення залежностей проєкту,
#  тобто переліку пакетів, необхідних для його коректної роботи. Цей файл дозволяє легко управляти залежностями проєкту, особливо коли вам потрібно поділитися проєктом з іншими розробниками або розгорнути його в іншому середовищі.
# Ви можете автоматично згенерувати requirements.txt за допомогою pip. 
# Для цього просто запустіть наступну команду у вашому віртуальному середовищі:

# pip freeze > requirements.txt

# Коли ви ділитеся своїм проєктом з іншими розробниками або розгортаєте його на іншому сервері 
# чи у віртуальному середовищі, requirements.txt забезпечує, що всі необхідні пакети будуть 
# встановлені для коректної роботи вашого проєкту.
# Щоб встановити пакети, перелічені у requirements.txt, використовуйте команду:

# pip install -r requirements.txt
# '''



# '''Принцип KISS (Keep It Simple, Stupid) — це концепція в дизайні та програмуванні, 
# яка підкреслює важливість простоти у розробці. Основна ідея полягає в тому, щоб утримуватись 
# від зайвої складності та зробити рішення якомога більш простими та зрозумілими.
# '''
# def is_even(number: int) -> bool:
#     if number % 2 == 0:
#         return True
#     else:
#         return False
# #Принцип KISS:
# def is_even(number: int) -> bool:
#     return number % 2 == 0

# #чи є рядок паліндромом: рядок “Козак з казок” є паліндромом, бо читається однаково з двох сторін.
# def is_palindrome(s: str) -> bool:
#     new_s = ""
#     for char in s:
#         if char.isalnum():
#             new_s += char.lower()
    
#     s = new_s # “козакзказок”
#     length = len(s)
#     for i in range(length // 2): # Цикл for проходить через половину символів рядка, 
# #оскільки достатньо перевірити лише половину символів, щоб визначити, чи є рядок паліндромом.
# # s[i] є поточним символом з лівої сторони.
# # s[length - i - 1] є відповідним символом з правої сторони.
# # Якщо ці символи не збігаються, рядок точно не є паліндромом, і функція повертає False.
#         if s[i] != s[length - i - 1]:
#             return False
#     return True
# print(is_palindrome("Козак з казок"))  #  True

# #Принцип KISS:
# def is_palindrome(s: str) -> bool:
#     new_s = ""
#     for char in s:
#         if char.isalnum():
#             new_s += char.lower()
#     s = new_s
#     return s == s[::-1]
# print(is_palindrome("Козак з казок"))  # Виведе: True



# '''Принцип DRY (Don't Repeat Yourself) закликає розробників уникати повторення 
# однакових частин коду у різних частинах програми.
# Застосування принципу DRY на рівні модулів дозволяє організувати повторювані функції 
# та класи в окремих файлах, з яких вони можуть бути імпортовані та використані в різних 
# частинах програми.'''
# length1, width1 = 5, 10
# area1 = length1 * width1
# length2, width2 = 7, 12
# area2 = length2 * width2

# #Щоб застосувати принцип DRY нам потрібно повторюваний код помістити в функцію.
# def calculate_area(length: float, width: float) -> float:
#     return length * width
# area1 = calculate_area(5, 10)
# area2 = calculate_area(7, 12)


# # math_operations.py
# def calculate_area(length, width):
#     return length * width

# from math_operations import calculate_area
# area1 = calculate_area(10, 5)
# area2 = calculate_area(20, 15)

# '''Наш main.py це файл, який є точкою входу для проєкту. Це означає, що коли ми запускаємо 
# проєкт, інтерпретатор Python починає виконувати код цього файлу. Це може бути корисним, 
# тому що нам не потрібно запускати кожен файл окремо, а можна використовувати одну точку входу 
# для запуску всієї програми.
# Щоб об'єднати файли в проєкті, можна імпортувати функції або класи з інших файлів у main.py. 
# Це може виглядати так:
# from my_module import my_function
# def main():
#     my_function()
# if __name__ == "__main__":
#     main()
# У цьому прикладі ми імпортуємо функцію my_function з файлу my_module.py і викликаємо її 
# в функції main(). Потім ми перевіряємо, чи запущено цей файл як основний скрипт 
# __name__ == "__main__", і якщо так, ми запускаємо функцію main(). 
# Це дозволяє використовувати цей файл як модуль для інших скриптів, не запускаючи 
# функцію main(), якщо він імпортований як модуль.
# '''

# from pathlib import Path
# BASE_DIR = Path(__file__).parent# Отримати шлях до директорії скрипта
# filename = BASE_DIR / "temperatures.txt"
# with open(filename, "r") as file:
#     raw_data = file.read()
# # Path(__file__).parent → повертає директорію, де лежить main.py
# # Тоді filename завжди буде правильним, незалежно від того, звідки запускаєш Python


# '''Основною метою модулів в Python є організація та повторне використання коду. 
# Модулі дозволяють розбивати програми на менші частини, які легше підтримувати, тестувати 
# та використовувати повторно в інших проєктах.'''